Revit 2024 API
ReinforcementRoundingManager Methods
The ReinforcementRoundingManager type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLengthUnitTypeId
 Gets the identifier of the length unit quantifying the reinforcement rounding values.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace